SGLang_Data_20260615_dp2_sweep/hisim_rtx6000/hisim_rtx6000_dp2_rr12_il1024_ol128.log
benchmark_args=Namespace(bench_mode='simulation', backend='sglang', base_url=None, host='127.0.0.1', port=32151, dataset_name='random', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=12.0, use_trace_timestamps=False, max_concurrency=None, output_file='/mnt/nfs02/users/tjiang/Gitrepo/sglang/SGLang_Data_20260615_dp2_sweep/hisim_rtx6000/hisim_rtx6000_dp2_rr12_il1024_ol128.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=True, return_logprob=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(bench_mode='simulation', backend='sglang', base_url=None, host='127.0.0.1', port=32151, dataset_name='random', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=12.0, use_trace_timestamps=False, max_concurrency=None, output_file='/mnt/nfs02/users/tjiang/Gitrepo/sglang/SGLang_Data_20260615_dp2_sweep/hisim_rtx6000/hisim_rtx6000_dp2_rr12_il1024_ol128.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=True, return_logprob=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 101360
#Output tokens: 13323
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
async_request_profile api_url='http://127.0.0.1:32151/start_profile' body={'activities': ['CPU', 'GPU'], 'num_steps': None, 'profile_by_stage': False, 'profile_stages': None}
Simulation triggered
async_request_profile api_url='http://127.0.0.1:32151/start_profile' body={'activities': ['CPU', 'GPU'], 'num_steps': None, 'profile_by_stage': False, 'profile_stages': None}
Simulation stop triggered

============ Serving Benchmark Result ============
Benchmark Mode:                          simulation
Backend:                                 sglang    
Traffic request rate:                    12.0      
Max request concurrency:                 not set   
Successful requests:                     200       
Benchmark duration (s):                  17.66     
Elapsed time (s):                        3.94      
Total input tokens:                      101020    
Total input text tokens:                 -1        
Total input vision tokens:               -1        
Total generated tokens:                  13323     
Total generated tokens (retokenized):    -1        
Request throughput (req/s):              11.33     
Input token throughput (tok/s):          5721.57   
Output token throughput (tok/s):         754.59    
Peak output token throughput (tok/s):    -1.00     
Peak concurrent requests:                -1        
Total token throughput (tok/s):          6476.16   
Concurrency:                             -1.00     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   951.09    
Median E2E Latency (ms):                 950.73    
---------------Time to First Token----------------
Mean TTFT (ms):                          17.31     
Median TTFT (ms):                        17.55     
P99 TTFT (ms):                           23.68     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.26     
Median TPOT (ms):                        14.22     
P99 TPOT (ms):                           18.00     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           14.23     
Median ITL (ms):                         12.54     
P95 ITL (ms):                            23.88     
P99 ITL (ms):                            35.02     
Max ITL (ms):                            68.80     
==================================================